{
  "architectures": [
    "ResNetForImageClassification"
  ],
  "depths": [
    2,
    2,
    2,
    2
  ],
  "downsample_in_bottleneck": false,
  "downsample_in_first_stage": false,
  "dtype": "float32",
  "embedding_size": 64,
  "hidden_act": "relu",
  "hidden_sizes": [
    64,
    128,
    256,
    512
  ],
  "id2label": {
    "0": " A",
    "1": " B",
    "2": " C",
    "3": " D",
    "4": " E",
    "5": " F",
    "6": " G",
    "7": " H",
    "8": " I",
    "9": " J",
    "10": " K",
    "11": " L",
    "12": " M",
    "13": " N",
    "14": " O",
    "15": " P",
    "16": " Q",
    "17": " R",
    "18": " S",
    "19": " T",
    "20": " U",
    "21": " V",
    "22": " W",
    "23": " X",
    "24": " Y",
    "25": " Z"
  },
  "label2id": {
    " A": 0,
    " B": 1,
    " C": 2,
    " D": 3,
    " E": 4,
    " F": 5,
    " G": 6,
    " H": 7,
    " I": 8,
    " J": 9,
    " K": 10,
    " L": 11,
    " M": 12,
    " N": 13,
    " O": 14,
    " P": 15,
    " Q": 16,
    " R": 17,
    " S": 18,
    " T": 19,
    " U": 20,
    " V": 21,
    " W": 22,
    " X": 23,
    " Y": 24,
    " Z": 25
  },
  "layer_type": "basic",
  "model_type": "resnet",
  "num_channels": 3,
  "out_features": [
    "stage4"
  ],
  "out_indices": [
    4
  ],
  "problem_type": "single_label_classification",
  "stage_names": [
    "stem",
    "stage1",
    "stage2",
    "stage3",
    "stage4"
  ],
  "transformers_version": "4.56.1"
}
